Revit 2024 API
FailuresAccessor.IsPending Method
 Checks if the failure processing is pending.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsPending()
Visual Basic
Public Function IsPending As Boolean
Visual C++
public:
bool IsPending()
Return Value
 True if the failures processing is in the pending state.
Remarks
 The failure processing is pending after failures processor has returned WaitForUserInput and until pending state is finished by either committing or rolling back of the pending transaction.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace